Repository: TheInfinityNet/net-server
Catalog: Identity.Application/Resources/IdentitySharedResource.*.resx
Languages: vi_vn

source: Uncategorized
vi_vn: Chưa phân loại

# not_have_permission
source: You do not have permission to perform this action
vi_vn: Bạn không có quyền thực hiện hành động này

# msg_test
source: Hello {0}, this is a test message
vi_vn: Xin chào {0}, đây là một tin nhắn kiểm tra

source: File upload failed
vi_vn: Tải tệp lên thất bại

# delete_file_failed
source: File deletion failed
vi_vn: Xóa tệp thất bại

# delete_folder_failed
source: Folder deletion failed
vi_vn: Xóa thư mục thất bại

# refresh_token_success
source: Token refreshed
vi_vn: Làm mới token thành công

# verify_email_success
source: Email verified, please sign in
vi_vn: Email đã được xác minh, vui lòng đăng nhập

# null_email
source: Email is required
vi_vn: Email không được để trống

# null_password
source: Password is required
vi_vn: Mật khẩu không được để trống

# size_password
source: Password must be at least 6 characters long and 20 characters at most
vi_vn: Mật khẩu phải có ít nhất 6 ký tự và không quá 20 ký tự

# null_token
source: Token cannot is required
vi_vn: Token không được để trống

# null_verification_type
source: Verification type is required
vi_vn: Loại xác minh không được để trống

# sign_up_success
source: User registered successfully, please verify your email
vi_vn: Đăng ký thành công, vui lòng xác minh email của bạn

# send_forgot_password_email_success
source: Forgot password email sent, please check your inbox
vi_vn: Email quên mật khẩu đã được gửi, vui lòng kiểm tra hộp thư

# verify_forgot_password_code_success
source: Email verified, please sign in
vi_vn: Email đã được xác minh, vui lòng đăng nhập

# reset_password_success
source: Password reset successfully
vi_vn: Đặt lại mật khẩu thành công

# send_verification_email_success
source: Verification email sent, please check your inbox
vi_vn: Email xác minh đã được gửi, vui lòng kiểm tra hộp thư

source: Validation error
vi_vn: Lỗi xác thực

# invalid_email
source: Invalid email address
vi_vn: Địa chỉ email không hợp lệ

# weak_password
source: Password is too weak
vi_vn: Mật khẩu quá yếu

source: Password mismatch
vi_vn: Mật khẩu không khớp

# terms_not_accepted
source: You must accept the terms and conditions
vi_vn: Bạn phải chấp nhận các điều khoản và điều kiện

# wrong_password
source: Incorrect password
vi_vn: Mật khẩu không chính xác

# expired_password
source: Password is expired
vi_vn: Mật khẩu đã hết hạn

source: Two factor required
vi_vn: Yêu cầu xác thực hai yếu tố

# token_missing
source: Token is missing
vi_vn: Thiếu token

# token_invalid
source: Invalid token
vi_vn: Token không hợp lệ

# token_expired
source: Refresh token has expired
vi_vn: Token làm mới đã hết hạn

# invalid_token
source: Invalid refresh token
vi_vn: Token làm mới không hợp lệ

# token_revoked
source: Refresh token has been revoked
vi_vn: Token làm mới đã bị thu hồi

# token_blacklisted
source: Refresh token is blacklisted
vi_vn: Token làm mới đã bị liệt vào danh sách đen

# invalid_signature
source: Invalid token signature
vi_vn: Chữ ký token không hợp lệ

# code_invalid
source: Verification code is invalid
vi_vn: Mã xác minh không hợp lệ

source: User disabled
vi_vn: Tài khoản bị vô hiệu hóa

source: User not activated
vi_vn: Tài khoản chưa được kích hoạt

source: User not found
vi_vn: Không tìm thấy người dùng

source: Email already in use
vi_vn: Email đã được sử dụng

source: User already verified
vi_vn: Người dùng đã được xác minh

source: Cannot send email
vi_vn: Không thể gửi email

source: Username already in use
vi_vn: Tên người dùng đã được sử dụng

source: Too many requests
vi_vn: Quá nhiều yêu cầu

source: Rate limit exceeded
vi_vn: Vượt quá giới hạn yêu cầu

# test_msg
source: Hello {0}
vi_vn: Xin chào {0}
